weblate/trans/tests/data/microsoftterminology.wsdl.wsdl0

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions targetNamespace="http://api.terminology.microsoft.com/terminology" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://api.terminology.microsoft.com/terminology" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:types><xsd:schema targetNamespace="http://api.terminology.microsoft.com/terminology/Imports"><xsd:import schemaLocation="http://api.terminology.microsoft.com/Terminology.svc?xsd=xsd0" namespace="http://api.terminology.microsoft.com/terminology"/><xsd:import schemaLocation="http://api.terminology.microsoft.com/Terminology.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="http://api.terminology.microsoft.com/Terminology.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/Microsoft.Terminology.WebService.Index.Core"/><xsd:import schemaLocation="http://api.terminology.microsoft.com/Terminology.svc?xsd=xsd3" namespace="http://schemas.datacontract.org/2004/07/Microsoft.Terminology.WebService.Index.Entities"/></xsd:schema></wsdl:types><wsdl:message name="Terminology_GetTranslations_InputMessage"><wsdl:part name="parameters" element="tns:GetTranslations"/></wsdl:message><wsdl:message name="Terminology_GetTranslations_OutputMessage"><wsdl:part name="parameters" element="tns:GetTranslationsResponse"/></wsdl:message><wsdl:message name="Terminology_GetTranslations_UnexpectedFault_FaultMessage"><wsdl:part name="detail" element="tns:Unexpected"/></wsdl:message><wsdl:message name="Terminology_GetTranslations_MissingParameterFault_FaultMessage"><wsdl:part name="detail" element="tns:MissingParameter"/></wsdl:message><wsdl:message name="Terminology_GetTranslations_InvalidParametersFault_FaultMessage"><wsdl:part name="detail" element="tns:InvalidParameters"/></wsdl:message><wsdl:message name="Terminology_GetLanguages_InputMessage"><wsdl:part name="parameters" element="tns:GetLanguages"/></wsdl:message><wsdl:message name="Terminology_GetLanguages_OutputMessage"><wsdl:part name="parameters" element="tns:GetLanguagesResponse"/></wsdl:message><wsdl:message name="Terminology_GetLanguages_UnexpectedFault_FaultMessage"><wsdl:part name="detail" element="tns:Unexpected"/></wsdl:message><wsdl:message name="Terminology_GetProducts_InputMessage"><wsdl:part name="parameters" element="tns:GetProducts"/></wsdl:message><wsdl:message name="Terminology_GetProducts_OutputMessage"><wsdl:part name="parameters" element="tns:GetProductsResponse"/></wsdl:message><wsdl:message name="Terminology_GetProducts_UnexpectedFault_FaultMessage"><wsdl:part name="detail" element="tns:Unexpected"/></wsdl:message><wsdl:message name="Terminology_GetCapability_InputMessage"><wsdl:part name="parameters" element="tns:GetCapability"/></wsdl:message><wsdl:message name="Terminology_GetCapability_OutputMessage"><wsdl:part name="parameters" element="tns:GetCapabilityResponse"/></wsdl:message><wsdl:portType name="Terminology"><wsdl:operation name="GetTranslations"><wsdl:input wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetTranslations" message="tns:Terminology_GetTranslations_InputMessage"/><wsdl:output wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetTranslationsResponse" message="tns:Terminology_GetTranslations_OutputMessage"/><wsdl:fault wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetTranslationsUnexpectedFault" name="UnexpectedFault" message="tns:Terminology_GetTranslations_UnexpectedFault_FaultMessage"/><wsdl:fault wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetTranslationsMissingParameterFault" name="MissingParameterFault" message="tns:Terminology_GetTranslations_MissingParameterFault_FaultMessage"/><wsdl:fault wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetTranslationsInvalidParametersFault" name="InvalidParametersFault" message="tns:Terminology_GetTranslations_InvalidParametersFault_FaultMessage"/></wsdl:operation><wsdl:operation name="GetLanguages"><wsdl:input wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetLanguages" message="tns:Terminology_GetLanguages_InputMessage"/><wsdl:output wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetLanguagesResponse" message="tns:Terminology_GetLanguages_OutputMessage"/><wsdl:fault wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetLanguagesUnexpectedFault" name="UnexpectedFault" message="tns:Terminology_GetLanguages_UnexpectedFault_FaultMessage"/></wsdl:operation><wsdl:operation name="GetProducts"><wsdl:input wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetProducts" message="tns:Terminology_GetProducts_InputMessage"/><wsdl:output wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetProductsResponse" message="tns:Terminology_GetProducts_OutputMessage"/><wsdl:fault wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetProductsUnexpectedFault" name="UnexpectedFault" message="tns:Terminology_GetProducts_UnexpectedFault_FaultMessage"/></wsdl:operation><wsdl:operation name="GetCapability"><wsdl:input wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetCapability" message="tns:Terminology_GetCapability_InputMessage"/><wsdl:output wsaw:Action="http://api.terminology.microsoft.com/terminology/Terminology/GetCapabilityResponse" message="tns:Terminology_GetCapability_OutputMessage"/></wsdl:operation></wsdl:portType></wsdl:definitions>