weblate/templates/machine/microsoft_terminology_getlanguages.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://api.terminology.microsoft.com/terminology">
    <soapenv:Header/>
    <soapenv:Body>
        <GetLanguages/>
    </soapenv:Body>
</soapenv:Envelope>
